

       IDENTIFICATION DIVISION.
       PROGRAM-ID.   EX2.
       AUTHOR.       Joshua Waters.
       DATE-WRITTEN. 15/07/22.
      *
       ENVIRONMENT DIVISION.
      *
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01 WS-COUNTER PIC 9(3) VALUE 1.
       01 WS-TYPE-COUNTER PIC 9(3) VALUE 1.
       01 WS-TYPE PIC 9 VALUE 0.
      *
       PROCEDURE DIVISION.

       PROGRAM-CONTROL.
           PERFORM HELLO-WORLD

           PERFORM COUNT-TO-100 UNTIL WS-COUNTER = 100

           PERFORM COUNT-TYPE-TO-100

           STOP RUN.

       HELLO-WORLD.
           DISPLAY 'HELLO WORLD'.

       COUNT-TO-100.
           DISPLAY 'WS-COUNTER: ' WS-COUNTER
           ADD 1 TO WS-COUNTER.

       COUNT-TYPE-TO-100.
           PERFORM COUNT-TO-EVEN-OR-ODD-100 UNTIL WS-TYPE-COUNTER = 101
           COMPUTE WS-TYPE-COUNTER = 1
           COMPUTE WS-TYPE = 1
           PERFORM COUNT-TO-EVEN-OR-ODD-100 UNTIL WS-TYPE-COUNTER = 100.

       COUNT-TO-EVEN-OR-ODD-100.
           IF FUNCTION MOD(WS-TYPE-COUNTER, 2) = WS-TYPE THEN
                DISPLAY 'WS-TYPE-COUNTER: ' WS-TYPE-COUNTER
           END-IF
           ADD 1 TO WS-TYPE-COUNTER.