//P10      EXEC PGM=EX3                           
//SYSUDUMP DD SYSOUT=*                            
//ABENDAID DD SYSOUT=*                            
//SYSOUT   DD SYSOUT=*                            
//CDIN     DD DSN=[filepath].INPUT,DISP=SHR
//IOMODOUT DD SYSOUT=*                            
//SYSABOUT DD SYSOUT=*                            
//EQADEBUG DD DSN=[filepath].SYSDEBUG,DISP=SHR 
//         DD DSN=[filepath].SYSDEBUG,DISP=SHR 
//         DD DSN=[filepath].LANGX,DISP=SHR    