//P10      EXEC PGM=EX2                          
//SYSUDUMP DD SYSOUT=*                           
//ABENDAID DD SYSOUT=*                           
//SYSOUT   DD SYSOUT=*                           
//IOMODOUT DD SYSOUT=*                           
//SYSABOUT DD SYSOUT=*                           
//EQADEBUG DD DSN=[filepath].SYSDEBUG,DISP=SHR
//         DD DSN=[filepath].SYSDEBUG,DISP=SHR
//         DD DSN=[filepath].LANGX,DISP=SHR   